
## Plan Result (terraform/cloudflare/b0xp.io/portfolio)

[CI link](https://github.com/boxp/arch/actions/runs/8847451611)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_record.top
  * cloudflare_record.www


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_record.top will be created
  + resource "cloudflare_record" "top" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "shanghai-4t4.pages.dev"
      + zone_id         = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_record.www will be created
  + resource "cloudflare_record" "www" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "shanghai-4t4.pages.dev"
      + zone_id         = "ec593206d0ef695c3aae3a4cb3173264"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label terraform/cloudflare/b0xp.io/portfolio/add-or-update: POST https://api.github.com/repos/boxp/arch/issues/319/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":319,"Program":"tfcmt","SHA1":"938972c1da0083f91827d6708761c2e3891f4e1e","Target":"terraform/cloudflare/b0xp.io/portfolio","Vars":{},"WorkflowName":"pull_request_target"} -->